[
  {
    "start": "October 2017",
    "end": "March 2018",
    "name": "Brandon Portfolio Website",
    "description": [
      "The objective of this project was to create a portfolio website that showcases my CV information and work portfolio. The development process took approximately 5 months and involved creating a responsive website that adjusts its size according to the device resolution.",
      "The frontend of the website was constructed using AngularJS and Bootstrap frameworks, along with HTML, CSS, and JavaScript. The backend was created using JQuery and PHP.",
      "The website features various capabilities, such as an email contact system, which allows users to reach out to me. The email received can be seen in the carousel. Another key feature is the portfolio filtering, which displays or hides items based on criteria such as website development or game development."
    ],
    "technologies": [
      "HTML",
      "CSS",
      "JQuery",
      "JavaScript",
      "Bootstrap Framework",
      "Angular JS"
    ],
    "buttons": [],
    "videos": [],
    "images": 4
  },
  {
    "start": "November 2017",
    "end": "January 2018",
    "name": "Chess Game in Java",
    "description": [
      "This task involved creating a Chess Game Analysis that processes a text file containing moves, some of which may be invalid. From this text file, various analytics were generated, including the most frequently moved piece, the winning player, and the number of invalid moves.",
      "The text file was used to present a graphical representation of the game state. The chess logic incorporated features like castling and pawn promotion. The project taught me to utilize design patterns such as the observer pattern and to ensure that each method has a single, clear purpose."
    ],
    "technologies": [
      "Java"
    ],
    "buttons": [],
    "videos": [],
    "images": 3
  },
  {
    "start": "November 2017",
    "end": "January 2018",
    "name": "LegOOPolis in C++",
    "description": [
      "A C++-based Lego Building Simulator was developed to process specifications from a text file, including the number of lego blocks, windows, doors, and the number of required buildings (e.g. 5 universities and 3 one-story houses). This task enabled experimentation with object-oriented programming and creation of a linked list library. Several classes were designed for reuse, such as a templated linked list library. The simulation then calculated statistics based on the file specifications, including the number of successfully built buildings and the percentage built from the text file."
    ],
    "technologies": [
      "C++"
    ],
    "buttons": [],
    "videos": [],
    "images": 3
  },
  {
    "start": "December 2017",
    "end": "January 2018",
    "name": "Algorithms in Golang",
    "description": [
      "To learn the Go programming language, several algorithms were programmed, including:",
      "The Fibonacci function using both direct and indirect recursion. The Reverse function, which was implemented using an iterative approach with a temporary variable to loop through half the array.",
      "The Map function, which applies a specified function to each value in a list (e.g. applying multiplyBy2 to [5, 2, 7] returns [10, 4, 14]). The Filter function, which filters a list based on a boolean function (e.g. applying the isEven function to [2, 7, 4] returns [2, 4]). The Reduce function, which returns a single value that reflects the combined version of a list (e.g. using the addition function on [5, 3, 7] returns 15).",
      "Once familiar with the Go syntax, several programs were implemented using channels. Through the use of channels, the power of concurrent systems became evident. Some of the functions implemented using channels include:",
      "The Tail function, which takes a channel of values and discards the first value while pushing the rest into an output channel, resulting in the tail of the passed array when read. The Fibonacci function, which takes an output channel and generates a Fibonacci value each time the output channel is called. This function also makes use of another method that uses channels within channels, such as the Prefix function, which takes a value and pushes it at the head of the channel."
    ],
    "technologies": [
      "Golang"
    ],
    "buttons": [],
    "videos": [],
    "images": 2
  },
  {
    "start": "October 2017",
    "end": "November 2017",
    "name": "Mobile Network Simulation",
    "description": [
      "A telecommunication network system was developed using Erlang Language, consisting of 3 major modules: switch, server generic, and mobile. Additionally, a utility module was created to handle standard functions such as fetching, storing, and removing based on a list. These modules also handle error handling in the program.",
      "The switch manages tasks such as subscribing and unsubscribing phones, attaching and detaching them, and sending messages. To attach a phone to the switch, you need to call the attach function method after registering the phone through subscribing.",
      "The server generic manages transmission types such as synchronous and asynchronous calls, and controls the main loop of the program where certain functions are executed.",
      "The mobile module handles tasks like instantiating a mobile, terminating a phone process, turning it on and off, toggling flight mode, sending and reading messages. If a phone's flight mode is on, messages sent to that phone are received."
    ],
    "technologies": [
      "Erlang"
    ],
    "buttons": [],
    "videos": [],
    "images": 4
  },
  {
    "start": "September 2017",
    "end": "September 2017",
    "name": "Image Processing in Haskell",
    "description": [
      "A set of algorithms were developed in Haskell to learn the programming language, mainly focused on image processing.",
      "The initial algorithms used a library to access data structures such as RGB and processed images pixel by pixel. Some of the algorithms developed include flipping images vertically, darkening, desaturating, and selective desaturating, which enhances a specific colour in an image.",
      "Function composition was then utilized to create functions that take a pixel and perform specific actions. A number of algorithms were developed, including flipping images vertically, redden, desaturate, fade, superimposing multiple images, and defining a new operator to superimpose images.",
      "With further understanding of these principles, data structures were utilized to create a structure that converts colour structures to RGB or vice versa, using specific data structures such as HSV to RGB. Algorithms were developed to recolour images based on a function, desaturate based on HSV colour, and invert RGB. These algorithms used a data structure commonly used in compression, which divides an image into quadrants and continues to split them until blocks of the same colour are found. This data structure was used to create an optimized version of an image.",
      "Another data structure developed was the colour model, which takes a colour of any type and has functions to brighten and redden it. Instances of this data structure were created for specific colour formats such as HSV and RGB."
    ],
    "technologies": [
      "Haskell"
    ],
    "buttons": [],
    "videos": [],
    "images": 5
  },
  {
    "start": "March 2017",
    "end": "May 2017",
    "name": "System Console in C",
    "description": [
      "A system console was developed in C on the Linux operating system, consisting of three parts.",
      "One section of the console is the clock, which operates by creating a child process from the parent process. This process updates a shared memory segment, which the main program reads, allowing the main process to update the panel based on the memory segment's values.",
      "Another part of the console catches signals generated by another program. Every received signal is recorded, and the time difference between two signals is calculated. A colour is lit based on the time difference. The other process can signal this process using the unique process ID, displayed at the bottom of the panel.",
      "The main part of the console is the terminal window, using Linux as an intermediary between the program and the user. Additional functions were written into the program, such as writing the command response to a desired text file and scrolling within the window using commands like \"move -5\". The application uses standard Linux commands, such as \"ps\", to display a list of running processes in the respective panel."
    ],
    "technologies": [
      "C"
    ],
    "buttons": [],
    "videos": [],
    "images": 7
  },
  {
    "start": "November 2016",
    "end": "January 2017",
    "name": "Tree Data Structure in C",
    "description": [
      "I built a tree data structure with standard optimizations for adding, deleting, and editing nodes. These functions were packaged as a library for use in other projects with similar requirements. The advantage of this data structure was the availability of necessary methods and desired parameters.",
      "The tree structure was designed to store text files, where a node can be either a folder or a text file. If the node is a text file, it has no children and is considered a leaf. A folder serves as a parent and can hold multiple nodes. Additionally, the program was designed to support saving and loading the data structure, allowing the user to store it on their computer and resume editing later."
    ],
    "technologies": [
      "C"
    ],
    "buttons": [],
    "videos": [],
    "images": 6
  },
  {
    "start": "November 2016",
    "end": "January 2017",
    "name": "Algorithms in C",
    "description": [
      "A set of algorithms were developed to learn the C programming language.",
      "One of the algorithms was to read a specified number of lines from a text file, given as program arguments, and display each line to the user. Another similar program was the \"tail\" program which, using program arguments, sets the number of lines to be read from the end of the text file.",
      "The \"tokenizer\" program was also implemented. Based on a predefined location of a text file, it tokenized the text based on certain conditions. For example, special characters were ignored, integers and floats were considered separate tokens, and strings and elements enclosed in brackets were stored as strings.",
      "An algorithm to think in a recursive manner was the reversal of a given string, either using an iterative or recursive approach. The \"introspect\" program helped to understand the memory system in the C programming language, which many languages do not provide such insight into. It was observed that a given string was stored as a block of memory, with memory locations incremented by one for each character.",
      "Finally, the \"Levenshtein String Distance\" program was implemented, which calculates the minimum number of edits required to convert one string into another. This algorithm is commonly used in data structures and algorithms."
    ],
    "technologies": [
      "C"
    ],
    "buttons": [],
    "videos": [],
    "images": 5
  },
  {
    "start": "July 2015",
    "end": "October 2015",
    "name": "Garage Scene",
    "description": [
      "This task involved using various applications, including Maya, Photoshop, and Quixel NDO toolkit, to create specular and normal maps. Although I was familiar with the software, this gave me the opportunity to explore lighting and mapping more, as seen in the carousel.",
      "The scene was set in a garage, featuring a running robot and an Audi R8 car. The models were designed to be usable in a game once the scene was finished and rendered. The Maya Mental Ray plugin was used for rendering, providing detailed textures and refined render settings, such as sampling quality and global illumination.",
      "Additionally, this task involved creating a rig for the robot to run and using the animation in the game. It also allowed me to modify the curve animation for a robot-like movement without acceleration at the ends and a smooth looping transition."
    ],
    "technologies": [
      "Autodesk Maya"
    ],
    "buttons": [],
    "videos": [
      "https://www.youtube.com/embed/y2D36klJ4b4"
    ],
    "images": 3
  },
  {
    "start": "May 2015",
    "end": "July 2015",
    "name": "Tower Shape",
    "description": [
      "This task involved developing a mobile game along with a logo for the Google Play Store. The objects and backgrounds were created with the target device in mind, using Photoshop and Unity.",
      "The game features a responsive UI and touch screen for gameplay. The biggest challenge was integrating a database from various platforms to add new high scores or download the top 5 player scores. This required accessing the database from the device and executing specific SQL queries."
    ],
    "technologies": [
      "JavaScript (Unity)"
    ],
    "buttons": [],
    "videos": [
      "https://www.youtube.com/embed/uYPbgNjZT_0"
    ],
    "images": 2
  },
  {
    "start": "November 2014",
    "end": "May 2015",
    "name": "Litter Monster",
    "description": [
      "This game was created as a product for a youth enterprise and marketed as an educational tool for children. Its goal is to educate kids about the environment through pop-up questions that only advance if the correct answer is selected. During the development process, I was able to experiment with marketing strategies, pitch the game to the Minister of Education, and draft a business proposal.",
      "As the product was sold, I received feedback about the game, even though it was tested by others before release. The goal is to introduce this educational game in schools to educate students in a fun and interactive way.",
      "I also designed logos for the game, which required a creative approach to capturing the intended concept digitally. Several logos were created with different colour variations and were presented to the team before selecting the final one."
    ],
    "technologies": [
      "C# (Unity)"
    ],
    "buttons": [
      {
        "text": "Visit Game Store",
        "link": "http://www.indiedb.com/games/litter-monster/"
      }
    ],
    "videos": [
      "https://www.youtube.com/embed/ALhI1H5fCwI"
    ],
    "images": 7
  }
]